// components/themesData.js:

const themes = {
  "Города": [
    "Барселона", "Мельбурн", "Вена", "Гамбург", "Хельсинки", "Дублин", "Прага",
    "Ванкувер", "Осака", "Амстердам", "Брюссель", "Будапешт", "Милан", "Лиссабон",
    "Сеул", "Майами", "Мадрид", "Эдинбург", "Копенгаген", "Стамбул"
  ],
  "Исторические личности": [
    "Юлий Цезарь", "Иван Грозный", "Галилео Галилей", "Наполеон", "Марко Поло",
    "Исаак Ньютон", "Шекспир", "Мария Стюарт", "Людвиг ван Бетховен", "Владимир Ленин",
    "Юрий Долгорукий", "Марк Твен", "Фридрих Ницше", "Александр Пушкин", "Леонардо да Винчи",
    "Карл Маркс", "Франц Кафка", "Жанна Дарк", "Стив Джобс", "Никола Тесла"
  ],
  "Напитки": [
    "Чай", "Сидр", "Матча", "Маргарита", "Виски", "Ёрш",
    "Глинтвейн", "Ром", "Боржоми", "Молоко", "Кофе", "Саке",
    "Абсент", "Ягермейстер", "Кокосовая вода", "Фанта", "Спрайт", "Буратино",
    "Шампанское", "Кефир"
  ],
  "Кинофильмы": [
    "Город грехов", "Малышка на миллион", "Темный рыцарь", "Великий Гэтсби",
    "Иван Васильевич меняет профессию", "Операция Ы", "Бриллиантовая рука", "Назад в будущее",
    "Титаник", "Джанго освобожденный", "Добро пожаловать или посторонним вход запрещен", "Волк с Уолл-стрит",
    "Терминатор", "Большой куш", "Матрица", "Побег из Шоушенка", "Хороший, плохой, злой",
    "Гарри Поттер", "Однажды в Голливуде", "Ирония судьбы"
  ],
  "Еда": [
    "Пельмени", "Лаша быстрого приготовления", "Шаурма", "Шашлык", "Суп-лапша", "Борщ", "Тако", "Пюрешка с котлетой",
    "Чизкейк", "Бублик", "Сосиска", "Плов", "Рататуй", "Гамбургер", "Буррито",
    "Ризотто", "Бешбармак", "Жаркое", "Хот дог", "Чипсы"
  ],
  "Страны": [
    "Непал", "Швейцария", "Аргентина", "Венгрия", "Португалия", "Новая Зеландия",
    "Греция", "Куба", "Вьетнам", "Чехия", "Перу", "Малайзия", "Финляндия",
    "Болгария", "Чили", "Казахстан", "Марокко", "Ливан", "Хорватия", "Исландия", "Индия", "Индонезия", "Иран", "Италия", "Китай", "Латвия", "Литва", "Люксембург", "Мальта", "Молдова", "Монако", "Мьянма", "Нидерланды", "Пакистан", "Польша", "Румыния", "Словакия", "Словения", "Таджикистан", "Тайвань", "Турция", "Узбекистан", "Филиппины", "Швеция", "Шри-Ланка", "Эстония", "Эфиопия", "Южная Корея", "Япония", "Азербайджан", "Албания", "Ангола", "Армения", "Афганистан", "Бразилия", "Ватикан", "Венесуэла", "Вьетнам", "Грузия", "Доминиканская Республика", "Египет", "Замбия", "Израиль", "Индонезия", "Иран", "Италия", "Камбоджа", "Катар", "Киргизия", "Севернеая Корея", "Колумбия", "Кувейт"
  ],
  "Природные явления": [
    "Метель", "Песчаная буря", "Солнечное гало", "Полярное сияние", "Падение метеорита",
    "Прилив и отлив", "Снежная буря", "Ледниковый период", "Торнадо",
    "Затопление", "Ледяной дождь", "Водоворот", "Жара", "Мороз", "Туман", "Мираж", "Грязевая лавина", "Снежинки", "Буран", "Солнечное затмение"
  ],
  "Цвета": [
    "Красный", "Синий", "Желтый", "Зеленый", "Белый", "Черный", "Коричневый",
    "Фиолетовый", "Розовый", "Оранжевый", "Голубой", "Серый", "Бежевый",
    "Лазурный", "Лимонный", "Морская волна", "Терракотовый", "Сливовый", 
    "Мятный", "Пурпурный"
  ],
  "Животные": [
    "Лев", "Слон", "Кенгуру", "Панда", "Тигр", "Коала", "Верблюд", "Пингвин",
    "Жираф", "Орел", "Волк", "Дельфин", "Осьминог", "Медведь", "Крокодил",
    "Фламинго", "Бегемот", "Шимпанзе", "Касатка", "Единорог"
  ],
  "Музыкальные инструменты": [
    "Гитара", "Скрипка", "Пианино", "Барабаны", "Саксофон", "Флейта",
    "Губная гармошка", "Арфа", "Виолончель", "Труба", "Аккордеон",
    "Ксилофон", "Гобой", "Скрипка", "Банджо", "Терменвокс", "Валторна",
    "Балалайка", "Укулеле", "Фагот"
  ],
  "Научные дисциплины": [
    "Биология", "Физика", "Химия", "Математика", "Астрономия", "Геология",
    "Антропология", "Психология", "История", "Философия", "Информатика",
    "Экология", "Генетика", "Метеорология", "Океанография", "Нейронаука",
    "Социология", "Лингвистика", "Политология", "Этология"
  ],
  "Литературные жанры": [
    "Роман", "Фантастика", "Детектив", "Поэзия", "Драма", "Комедия",
    "Исторический роман", "Ужасы", "Фэнтези", "Научная литература", "Биография",
    "Путеводитель", "Автобиография", "Мистика", "Триллер", "Сказка",
    "Нон-фикшн", "Мемуары", "Эссе", "Постмодернизм"
  ],
  "Спортивные дисциплины": [
    "Футбол", "Баскетбол", "Теннис", "Гимнастика", "Плавание", "Легкая атлетика",
    "Волейбол", "Гольф", "Бокс", "Фигурное катание", "Сноуборд", "Скалолазание",
    "Бадминтон", "Скейтбординг", "Йога", "Армрестлинг", "Дзюдо", "Регби",
    "Шахматы", "Американский футбол"
  ],
  "Технологии": [
    "Искусственный интеллект", "Блокчейн", "Виртуальная реальность", "Квантовые компьютеры",
    "Робототехника", "3D-печать", "Электромобили", "Беспилотные автомобили",
    "Солнечная энергетика", "Интернет вещей", "Биотехнологии", "Нанотехнологии",
    "Космические технологии", "Лазерные технологии",
    "Беспроводная зарядка", "Криптовалюты", "5G технология", "Биометрические технологии", "Метавселенные" 
  ],
  "Известные бренды": [
    "Apple", "Nike", "Coca-Cola", "Samsung", "Adidas", "Microsoft", "Toyota",
    "Louis Vuitton", "McDonald's", "BMW", "Intel", "Facebook", "Google", 
    "Chanel", "Amazon", "Gucci", "Pepsi", "Sony", "Honda", "Visa"
  ],
  "Музыкальные жанры": [
    "Рок", "Поп", "Джаз", "Классическая музыка", "Хип-хоп", "Электронная", 
    "Блюз", "Регги", "Кантри", "Фолк", "Инди", "Метал", "Панк", "R&B", 
    "Соул", "Рэп", "Латиноамериканская", "Фанк", "Диско", "Транс"
  ],
  "Великие изобретения": [
    "Колесо", "Печать", "Паровой двигатель", "Электрическая лампочка", "Телефон", 
    "Интернет", "Автомобиль", "Пенициллин", "Радио", "Телевизор", "Компьютер", 
    "Пластик", "Блокчейн", "Лазер", "GPS", "Фотография", "Самолет", "Шоколад", 
    "Микроскоп", "Часы"
  ],
  "Знаменитые актёры и актрисы": [
    "Наталья Крячковская", "Том Хэнкс", "Дензел Вашингтон", "Анджелина Джоли", "Леонардо ДиКаприо", 
    "Кейт Бланшетт", "Роберт Де Ниро", "Натали Портман", "Брэд Питт", "Хью Джекман", 
    "Скарлетт Йоханссон", "Морган Фриман", "Николь Кидман", "Джонни Депп", "Эмма Стоун", 
    "Джордж Клуни", "Юрий Никулин", "Уилл Смит", "Евгений Леонов", "Андрей Миронов"
  ],
  "Популярные приложения": [
    "WhatsApp", "Instagram", "TikTok", "Facebook", "Snapchat", "Spotify", "Uber", 
    "Airbnb", "Netflix", "YouTube", "Google Maps", "Twitter", "LinkedIn", "Pinterest", 
    "Telegram", "WeChat", "Zoom", "Slack", "Amazon", "Shazam"
  ],
  "Автомобильные бренды": [
    "Mercedes-Benz", "Ferrari", "Porsche", "Lamborghini", "Audi", "BMW", "Lexus", 
    "Toyota", "Honda", "Ford", "Chevrolet", "Tesla", "Volvo", "Nissan", "Volkswagen", 
    "Bentley", "Rolls-Royce", "Aston Martin", "Jaguar", "Maserati", "Москвич", "Запорожец", "Лада", "ГАЗ", "УАЗ", "Аурус"
  ]
};

export default themes;